class Seq:
    """
    Класс для хранения и обработки биологических последовательностей.

    Parameters
    ----------
    seq_id: str
        Идентификатор последовательности, передаваемый при создании объекта.
    seq: str
        Строка, содержащая биологическую последовательность.

    Attributes
    ----------
    seq_id: str
        Идентификатор последовательности.
    seq: str
        Биологическая последовательность, представленная строкой символов.
    """

    def __init__(self, seq_id: str, seq: str) -> None:
        """
        Инициализирует экземпляр класса Seq.

        Raises
        ------
        TypeError
            Если переданные аргументы имеют некорректный тип.
        ValueError
            Если идентификатор последовательности пустой,
            либо биологическая последовательность пуста.
        """
        if not isinstance(seq_id, str):
            raise TypeError("Идентификатор последовательности должен быть строкой.")
        if not isinstance(seq, str):
            raise TypeError("Биологическая последовательность должна быть строкой.")
        if not seq_id: 
            raise ValueError("Идентификатор последовательности не может быть пустым.")
        if not seq:
            raise ValueError("Последовательность не может быть пустой.")

        self.seq_id: str = seq_id
        self.seq: str = seq

    def __str__(self) -> str:
        """
        Возвращает строковое представление записи.

        Returns
        -------
        str
            Строка, содержащая идентификатор и биологическую
            последовательность, разделённые переносом строки.
        """
        return f"{self.seq_id}\n{self.seq}"

    def __len__(self) -> int:
        """
        Возвращает длину биологической последовательности.

        Returns
        -------
        int
            Длина последовательности.
        """
        return len(self.seq)